{"path":"/","templateID":0,"sharedPropsHashes":{},"localProps":{"intro":{"contents":"<h1 id=\"pool-support-volunteer-collaboration\">Pool² - Support volunteer collaboration</h1>\n<p>Pool² is the second version of the system introduced by <a href=\"https://www.vivaconagua.org/home\">Viva con Agua de St. Pauli e.V. (VcA)</a> supporting the \nvolunteers during their daily work. This tool is explicitly developed to support a socio-technical self-development.</p>\n<p>VcA is a decentralized social system of volunteers raising awareness and collecting donations for \nWASH (<code></code>Water, Sanitation and Hygiene&#39;&#39;) projects. Such projects address the establishment of \naccess to clean drinking water and basic sanitation for all humans worldwide. \nThe volunteers pursue their aims through creative and joyful activities, as defined by the self-description of \\vca . \nAs the volunteers get together and organize themselves in separated regional groups, those \\socialElement{local crews} \nare loosely coupled <a href=\"http://www.jstor.org/stable/2391875?origin=crossref\" title=\"K. E. Weick, “Educational Organizations as Loosely Coupled Systems,” Adm. Sci. Q., vol. 21, no. 1, pp. 1–19, Mar. 1976.\">(Weick, 1976)</a>. \nFurthermore, there is a small administration, called <em>Brunnenbüro</em>. This team has three purposes: </p>\n<ol>\n<li>Tie together all results from work done by the several <em>local crews</em>, </li>\n<li>controlling compliance with legal conditions and </li>\n<li>offering counsel for <em>local crews</em> if needed.</li>\n</ol>\n<p>The principle of <em>open participation</em> is of paramount importance for VcA. It describes the possibility to \n&quot;decide to get oneself involved in some activity this day and to veer away from it the next day&quot; \n<a href=\"https://cses.informatik.hu-berlin.de/pubs/2016/criwg/Rambla_Supporting_Collaborative_Group_Creativity_For_the_Purpose_of_Concept_Generation.pdf\" title=\"J. Sell and N. Pinkwart, “Rambla: Supporting collaborative group creativity for the purpose of concept generation,” in Proceedings of the 22th International Conference on Collaboration and Technology (CRIWG), 2016, vol. 9848 LNCS, pp. 81–97\">(Sell and Pinkwart, 2016, p. 82)</a>. Consequently, <em>open participation</em> forbids barriers for integration \nof new volunteers. Additionally, the success of the organization is mainly achieved by focusing on small projects, \ndecentralized and independent teams and the engagement of a mass of volunteers.</p>\n<p>Since the founding of VcA in 2006, the organization kept growing steadily, reaching a number of about 12,000 volunteers \nat the moment. The rapid growth of the social system was accompanied by development of decentralized social structures \ninside the organization, like the already mentioned <em>local crews</em>. Based on such new structures and the organizations \nrapid spread, the integration of technical tools was initiated and reached a peak with the development of the \n<a href=\"https://pool.vivaconagua.org/\">Pool</a>. It coordinates activities, handles finances, supports communication via mails and \nrepresents volunteers. These functions became an integral part of VcAs work processes. \nHence the tool became part of the social systems self description and both join into a socio-technical organization \n<a href=\"http://hdl.handle.net/2003/22226\" title=\"G. Kunau, “Facilitating computer supported cooperative work with socio-technical self-descriptions,” Technische Universität Dortmund, 2006.\">(Kunau, 2006)</a>.</p>\n<p>Even though VcA always tries to align the supported functions of the <a href=\"https://pool.vivaconagua.org/\">Pool</a> to the needs \nof the social system, they are not able to perform <em>joint optimization</em> all the time. \nFor example, several <em>crews</em> developed their own work processes to handle finances. These various procedures exist next to \neach other and focus the same goal. In the end, all existing financial procedures have to be considered for an \norganizational accounting. \nSince the current implementation of the <a href=\"https://pool.vivaconagua.org/\">Pool</a> does not allow to extend the work processes \nby alternatives, most concerned <em>local crews</em> tried to workaround and extend their offline working procedures instead of \nadopting the procedure, defined by the <a href=\"https://pool.vivaconagua.org/\">Pool</a>. This example shows that even though the \n<a href=\"https://pool.vivaconagua.org/\">Pool</a> allows to apply <em>organizational choice</em> in some degree, it is used to compensate \nfor missing possibilities to apply <em>joint optimization</em>.\nHowever, the implementation of email based newsletter introduced new work processes of formal communication with \nimplications for the social system, like the establishment of new roles to create and send new mails periodically. \nIt becomes clear that while <em>joint optimization</em> is not implemented yet, the social system respects and adopts new \nfunctions of the technical system.</p>\n<p>Additionally, even more possible support functions had been identified during a socio-technical walkthrough \n<a href=\"http://portal.acm.org/citation.cfm?doid=1011870.1011886\" title=\"T. Herrmann, G. Kunau, K.-U. Loser, and N. Menold, “Socio-technical walkthrough: designing technology along work processes,” in Proceedings of the eighth conference on Participatory design Artful integration: Interweaving Media, Materials and Practices - PDC 04, 2004, vol. 1, pp. 132–141.\">(Herrmann, 2004)</a>. However, implemented as a plugin for <a href=\"https://wordpress.org/\" title=\"Version 4.9.2; https://wordpress.org/, visited 2018-02-01\">WordPress</a> and after five years of further \ndevelopment, the <a href=\"https://pool.vivaconagua.org/\">Pool</a> is neither expandable nor maintainable. The project is missing men \npower and technological flexibility in order to address and overcome the new challenges resulting from ongoing change of \nthe social system. Therefore, the organization can not apply <em>joint optimization</em> with the purpose to change the \ntechnical system.</p>\n<p>Obviously, <em>joint optimization</em> and <em>organizational choice</em> had been applied, but since the number of crews scale up, \nconsidering both principles becomes more difficult. \nDuring the last years the <em>crews</em> of VcA developed more and more disjoint requirements. The maintainers of the \n<a href=\"https://pool.vivaconagua.org/\">Pool</a> were not able to integrate so many new needs. Simply strengthening the team of \nmaintainers becomes too expensive, since the social system is still expanding and each new crew will extend the set of \nrequirements. Furthermore, social systems are constantly undergoing a process of change. Thus, teams and <em>crews</em> will \npermanently develop new requirements. Only few of these new requirements can be adopted by the whole organization.</p>\n<p>Additionally, the success of VcA is based on voluntary mass collaboration that has been made possible by <em>open participation</em>. \nWe aim to consider the ongoing change of the social system and will also use mass collaboration and <em>open participation</em> \nto implement <em>joint optimization</em> and <em>organizational choice</em>.</p>\n<p>In the end, a decentralized, loosely coupled social system of software developer evolves, focusing small parts of the \ntechnical system.  </p>\n<h2 id=\"how-to-read-this-documentation-\">How to read this documentation?</h2>\n<p>There is a short <a href=\"/guides/edit-docu/\">introduction written as a guide</a>.</p>\n<p><strong>Author:</strong> <a href=\"https://cses.informatik.hu-berlin.de/members/johann.sell/\">Johann Sell</a> -- \n<strong>Created:</strong> 2018-05-18 --\n<strong>Updated:</strong> 2018-05-29</p>\n"},"jdown":{"contents":"<h2 id=\"jdown\">Jdown</h2>\n<p>Convert a directory of markdown files to structured and usable JSON</p>\n<ul>\n<li><a href=\"https://github.com/DanWebb/jdown\">Github</a></li>\n</ul>\n<p><img src=\"/jdown-logo.png\" alt=\"jdown\" title=\"Jdown logo\"></p>\n"},"reactStatic":{"contents":"<h2 id=\"react-static\">React Static</h2>\n<p>A <strong>progressive static-site generator</strong> for React.</p>\n<ul>\n<li><a href=\"https://github.com/nozzle/react-static\">Github</a></li>\n</ul>\n<p><img src=\"/logo.png\" alt=\"React Static\" title=\"React static logo\"></p>\n"}}}
